{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [4, 4], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wYAAAAAAAAAAAAAABAAAAAQAAAAQwAAAHNaAgAAdABqAHAMdACgAaEAfQZ8BmoCfQd8B2oDkAFy\nEHowdASgBXwGagZ8B2oHZAF8BXwHagh8AGQCfAFkA3wCZAR8A2QFfAShDn0IfAhXAFMABAB0CWoK\nawpyfAEAfQkBAHoQdAugDHwJfAWhAgEAVwA1AGQGfQl+CVgAWQBuFgQAdAlqDWsKcpABAAEAAQBZ\nAG4CWAB6GHQOfAB8AXwCfAN8BHwFfAZkB40HVwBTAAQAdAlqD2sKcsABAAEAAQBZAG5QBAB0EHQR\nZgJrCpABcg4BAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy\nCHwKBgBZAFMAggBZAG4CWAB8AWQGawiQAXIeZAp9AXQYoBl8AWQCoQJ9AXwCZAZrCJABcjhkC30C\ndBigGnwCZAOhAn0CfANkBmsIkAFyUmQLfQN0GKAafANkBKECfQN8BGQGawiQAXJsZAx9BHQYoBp8\nBGQFoQJ9BHokdBtqHGQBfAB8AXwCfAN8BHwFZAmNBy8EfQt9C30MfQ1XAG5QBAB0EHQRZgJrCpAB\ncuwBAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy5nwKBgBZ\nAFMAggBZAG4CWAB8DWQGZAaFAhkAfQh0GKAdoQCQAnJQZAJ8DKAeZAKhAWQDfAygH2QDoQFkBHwM\noB9kBKEBZAV8DKAfZAWhAWQNfAygIGQNoQFmCn0OfAxqIX0PdBigImQBfA98DnwIoQQBAHwILwF9\nCHwIUwApDuHxBAAATG9jYWwgUmVzcG9uc2UgTm9ybWFsaXphdGlvbi4KCiAgVGhlIDQtRCBgaW5w\ndXRgIHRlbnNvciBpcyB0cmVhdGVkIGFzIGEgMy1EIGFycmF5IG9mIDEtRCB2ZWN0b3JzIChhbG9u\nZyB0aGUgbGFzdAogIGRpbWVuc2lvbiksIGFuZCBlYWNoIHZlY3RvciBpcyBub3JtYWxpemVkIGlu\nZGVwZW5kZW50bHkuICBXaXRoaW4gYSBnaXZlbiB2ZWN0b3IsCiAgZWFjaCBjb21wb25lbnQgaXMg\nZGl2aWRlZCBieSB0aGUgd2VpZ2h0ZWQsIHNxdWFyZWQgc3VtIG9mIGlucHV0cyB3aXRoaW4KICBg\nZGVwdGhfcmFkaXVzYC4gIEluIGRldGFpbCwKCiAgICAgIHNxcl9zdW1bYSwgYiwgYywgZF0gPQog\nICAgICAgICAgc3VtKGlucHV0W2EsIGIsIGMsIGQgLSBkZXB0aF9yYWRpdXMgOiBkICsgZGVwdGhf\ncmFkaXVzICsgMV0gKiogMikKICAgICAgb3V0cHV0ID0gaW5wdXQgLyAoYmlhcyArIGFscGhhICog\nc3FyX3N1bSkgKiogYmV0YQoKICBGb3IgZGV0YWlscywgc2VlIFtLcml6aGV2c2t5IGV0IGFsLiwg\nSW1hZ2VOZXQgY2xhc3NpZmljYXRpb24gd2l0aCBkZWVwCiAgY29udm9sdXRpb25hbCBuZXVyYWwg\nbmV0d29ya3MgKE5JUFMgMjAxMildKGh0dHA6Ly9wYXBlcnMubmlwcy5jYy9wYXBlci80ODI0LWlt\nYWdlbmV0LWNsYXNzaWZpY2F0aW9uLXdpdGgtZGVlcC1jb252b2x1dGlvbmFsLW5ldXJhbC1uZXR3\nb3JrcykuCgogIEFyZ3M6CiAgICBpbnB1dDogQSBgVGVuc29yYC4gTXVzdCBiZSBvbmUgb2YgdGhl\nIGZvbGxvd2luZyB0eXBlczogYGhhbGZgLCBgYmZsb2F0MTZgLCBgZmxvYXQzMmAuCiAgICAgIDQt\nRC4KICAgIGRlcHRoX3JhZGl1czogQW4gb3B0aW9uYWwgYGludGAuIERlZmF1bHRzIHRvIGA1YC4K\nICAgICAgMC1ELiAgSGFsZi13aWR0aCBvZiB0aGUgMS1EIG5vcm1hbGl6YXRpb24gd2luZG93Lgog\nICAgYmlhczogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBbiBv\nZmZzZXQgKHVzdWFsbHkgcG9zaXRpdmUgdG8gYXZvaWQgZGl2aWRpbmcgYnkgMCkuCiAgICBhbHBo\nYTogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBIHNjYWxlIGZh\nY3RvciwgdXN1YWxseSBwb3NpdGl2ZS4KICAgIGJldGE6IEFuIG9wdGlvbmFsIGBmbG9hdGAuIERl\nZmF1bHRzIHRvIGAwLjVgLiBBbiBleHBvbmVudC4KICAgIG5hbWU6IEEgbmFtZSBmb3IgdGhlIG9w\nZXJhdGlvbiAob3B0aW9uYWwpLgoKICBSZXR1cm5zOgogICAgQSBgVGVuc29yYC4gSGFzIHRoZSBz\nYW1lIHR5cGUgYXMgYGlucHV0YC4KICDaA0xSTtoMZGVwdGhfcmFkaXVz2gRiaWFz2gVhbHBoYdoE\nYmV0YU6pBnIDAAAAcgQAAAByBQAAAHIGAAAA2gRuYW1l2gNjdHipACkG2gVpbnB1dHIDAAAAcgQA\nAAByBQAAAHIGAAAAcggAAADpBQAAAOkBAAAA5wAAAAAAAOA/2gFUKSPaCF9jb250ZXh02gdjb250\nZXh02hJfdGhyZWFkX2xvY2FsX2RhdGHaCGlzX2VhZ2Vy2gpweXdyYXBfdGZl2hZURkVfUHlfRmFz\ndFBhdGhFeGVjdXRl2g9fY29udGV4dF9oYW5kbGXaC2RldmljZV9uYW1l2gxvcF9jYWxsYmFja3Pa\nBV9jb3Jl2hVfTm90T2tTdGF0dXNFeGNlcHRpb27aBF9vcHPaGHJhaXNlX2Zyb21fbm90X29rX3N0\nYXR1c9oSX0ZhbGxiYWNrRXhjZXB0aW9u2hJscm5fZWFnZXJfZmFsbGJhY2vaEl9TeW1ib2xpY0V4\nY2VwdGlvbtoJVHlwZUVycm9y2gpWYWx1ZUVycm9y2glfZGlzcGF0Y2jaCGRpc3BhdGNo2gNscm7a\nBGRpY3TaDE9wRGlzcGF0Y2hlctoNTk9UX1NVUFBPUlRFRNoIX2V4ZWN1dGXaCG1ha2VfaW502gpt\nYWtlX2Zsb2F02g9fb3BfZGVmX2xpYnJhcnnaEF9hcHBseV9vcF9oZWxwZXLaFG11c3RfcmVjb3Jk\nX2dyYWRpZW502g1fZ2V0X2F0dHJfaW502ghnZXRfYXR0ctoOX2dldF9hdHRyX3R5cGXaBmlucHV0\nc9oPcmVjb3JkX2dyYWRpZW50KRByCwAAAHIDAAAAcgQAAAByBQAAAHIGAAAAcggAAADaBF9jdHja\nA3RsZNoHX3Jlc3VsdNoBZdoGcmVzdWx02gFf2gNfb3DaCF9vdXRwdXRz2gZfYXR0cnPaDF9pbnB1\ndHNfZmxhdHIKAAAAcgoAAAD6a0M6L1VzZXJzL0FETUlOL0FwcERhdGEvTG9jYWwvUHJvZ3JhbXMv\nUHl0aG9uL1B5dGhvbjM4L2xpYi9zaXRlLXBhY2thZ2VzL3RlbnNvcmZsb3cvcHl0aG9uL29wcy9n\nZW5fbm5fb3BzLnB5ciQAAAC8EgAAc9IAAAAAIA4BBgEIAQIBBAEEAAQAAgACAAQBAgACAAIAAgAC\nAAIAAgECAAL9BAQGARIBHAEQAQYBAgECAQIAAgACAAIAAgECAAL+CAMQAQQBFAEEAQIAAgAIAQIA\nAgAC/wT/BAQOAQgBCAIKAQQBDAEKAQQBDAEKAQQBDAEKAQQBDAECAQQBAgACAAIAAgACAQIAAv4S\nAxQBBAECAAIACAECAAIAAv8E/wQEDgEIAQgBDAEKAQwBCAACAAgAAgEIAAIACP4EAwYBBAECAAIA\nAgAC/wQCBgE=\n", [5, 1, 1, 0.5, null], null], "function_type": "lambda", "module": "tensorflow.python.ops.gen_nn_ops", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wYAAAAAAAAAAAAAABAAAAAQAAAAQwAAAHNaAgAAdABqAHAMdACgAaEAfQZ8BmoCfQd8B2oDkAFy\nEHowdASgBXwGagZ8B2oHZAF8BXwHagh8AGQCfAFkA3wCZAR8A2QFfAShDn0IfAhXAFMABAB0CWoK\nawpyfAEAfQkBAHoQdAugDHwJfAWhAgEAVwA1AGQGfQl+CVgAWQBuFgQAdAlqDWsKcpABAAEAAQBZ\nAG4CWAB6GHQOfAB8AXwCfAN8BHwFfAZkB40HVwBTAAQAdAlqD2sKcsABAAEAAQBZAG5QBAB0EHQR\nZgJrCpABcg4BAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy\nCHwKBgBZAFMAggBZAG4CWAB8AWQGawiQAXIeZAp9AXQYoBl8AWQCoQJ9AXwCZAZrCJABcjhkC30C\ndBigGnwCZAOhAn0CfANkBmsIkAFyUmQLfQN0GKAafANkBKECfQN8BGQGawiQAXJsZAx9BHQYoBp8\nBGQFoQJ9BHokdBtqHGQBfAB8AXwCfAN8BHwFZAmNBy8EfQt9C30MfQ1XAG5QBAB0EHQRZgJrCpAB\ncuwBAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy5nwKBgBZ\nAFMAggBZAG4CWAB8DWQGZAaFAhkAfQh0GKAdoQCQAnJQZAJ8DKAeZAKhAWQDfAygH2QDoQFkBHwM\noB9kBKEBZAV8DKAfZAWhAWQNfAygIGQNoQFmCn0OfAxqIX0PdBigImQBfA98DnwIoQQBAHwILwF9\nCHwIUwApDuHxBAAATG9jYWwgUmVzcG9uc2UgTm9ybWFsaXphdGlvbi4KCiAgVGhlIDQtRCBgaW5w\ndXRgIHRlbnNvciBpcyB0cmVhdGVkIGFzIGEgMy1EIGFycmF5IG9mIDEtRCB2ZWN0b3JzIChhbG9u\nZyB0aGUgbGFzdAogIGRpbWVuc2lvbiksIGFuZCBlYWNoIHZlY3RvciBpcyBub3JtYWxpemVkIGlu\nZGVwZW5kZW50bHkuICBXaXRoaW4gYSBnaXZlbiB2ZWN0b3IsCiAgZWFjaCBjb21wb25lbnQgaXMg\nZGl2aWRlZCBieSB0aGUgd2VpZ2h0ZWQsIHNxdWFyZWQgc3VtIG9mIGlucHV0cyB3aXRoaW4KICBg\nZGVwdGhfcmFkaXVzYC4gIEluIGRldGFpbCwKCiAgICAgIHNxcl9zdW1bYSwgYiwgYywgZF0gPQog\nICAgICAgICAgc3VtKGlucHV0W2EsIGIsIGMsIGQgLSBkZXB0aF9yYWRpdXMgOiBkICsgZGVwdGhf\ncmFkaXVzICsgMV0gKiogMikKICAgICAgb3V0cHV0ID0gaW5wdXQgLyAoYmlhcyArIGFscGhhICog\nc3FyX3N1bSkgKiogYmV0YQoKICBGb3IgZGV0YWlscywgc2VlIFtLcml6aGV2c2t5IGV0IGFsLiwg\nSW1hZ2VOZXQgY2xhc3NpZmljYXRpb24gd2l0aCBkZWVwCiAgY29udm9sdXRpb25hbCBuZXVyYWwg\nbmV0d29ya3MgKE5JUFMgMjAxMildKGh0dHA6Ly9wYXBlcnMubmlwcy5jYy9wYXBlci80ODI0LWlt\nYWdlbmV0LWNsYXNzaWZpY2F0aW9uLXdpdGgtZGVlcC1jb252b2x1dGlvbmFsLW5ldXJhbC1uZXR3\nb3JrcykuCgogIEFyZ3M6CiAgICBpbnB1dDogQSBgVGVuc29yYC4gTXVzdCBiZSBvbmUgb2YgdGhl\nIGZvbGxvd2luZyB0eXBlczogYGhhbGZgLCBgYmZsb2F0MTZgLCBgZmxvYXQzMmAuCiAgICAgIDQt\nRC4KICAgIGRlcHRoX3JhZGl1czogQW4gb3B0aW9uYWwgYGludGAuIERlZmF1bHRzIHRvIGA1YC4K\nICAgICAgMC1ELiAgSGFsZi13aWR0aCBvZiB0aGUgMS1EIG5vcm1hbGl6YXRpb24gd2luZG93Lgog\nICAgYmlhczogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBbiBv\nZmZzZXQgKHVzdWFsbHkgcG9zaXRpdmUgdG8gYXZvaWQgZGl2aWRpbmcgYnkgMCkuCiAgICBhbHBo\nYTogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBIHNjYWxlIGZh\nY3RvciwgdXN1YWxseSBwb3NpdGl2ZS4KICAgIGJldGE6IEFuIG9wdGlvbmFsIGBmbG9hdGAuIERl\nZmF1bHRzIHRvIGAwLjVgLiBBbiBleHBvbmVudC4KICAgIG5hbWU6IEEgbmFtZSBmb3IgdGhlIG9w\nZXJhdGlvbiAob3B0aW9uYWwpLgoKICBSZXR1cm5zOgogICAgQSBgVGVuc29yYC4gSGFzIHRoZSBz\nYW1lIHR5cGUgYXMgYGlucHV0YC4KICDaA0xSTtoMZGVwdGhfcmFkaXVz2gRiaWFz2gVhbHBoYdoE\nYmV0YU6pBnIDAAAAcgQAAAByBQAAAHIGAAAA2gRuYW1l2gNjdHipACkG2gVpbnB1dHIDAAAAcgQA\nAAByBQAAAHIGAAAAcggAAADpBQAAAOkBAAAA5wAAAAAAAOA/2gFUKSPaCF9jb250ZXh02gdjb250\nZXh02hJfdGhyZWFkX2xvY2FsX2RhdGHaCGlzX2VhZ2Vy2gpweXdyYXBfdGZl2hZURkVfUHlfRmFz\ndFBhdGhFeGVjdXRl2g9fY29udGV4dF9oYW5kbGXaC2RldmljZV9uYW1l2gxvcF9jYWxsYmFja3Pa\nBV9jb3Jl2hVfTm90T2tTdGF0dXNFeGNlcHRpb27aBF9vcHPaGHJhaXNlX2Zyb21fbm90X29rX3N0\nYXR1c9oSX0ZhbGxiYWNrRXhjZXB0aW9u2hJscm5fZWFnZXJfZmFsbGJhY2vaEl9TeW1ib2xpY0V4\nY2VwdGlvbtoJVHlwZUVycm9y2gpWYWx1ZUVycm9y2glfZGlzcGF0Y2jaCGRpc3BhdGNo2gNscm7a\nBGRpY3TaDE9wRGlzcGF0Y2hlctoNTk9UX1NVUFBPUlRFRNoIX2V4ZWN1dGXaCG1ha2VfaW502gpt\nYWtlX2Zsb2F02g9fb3BfZGVmX2xpYnJhcnnaEF9hcHBseV9vcF9oZWxwZXLaFG11c3RfcmVjb3Jk\nX2dyYWRpZW502g1fZ2V0X2F0dHJfaW502ghnZXRfYXR0ctoOX2dldF9hdHRyX3R5cGXaBmlucHV0\nc9oPcmVjb3JkX2dyYWRpZW50KRByCwAAAHIDAAAAcgQAAAByBQAAAHIGAAAAcggAAADaBF9jdHja\nA3RsZNoHX3Jlc3VsdNoBZdoGcmVzdWx02gFf2gNfb3DaCF9vdXRwdXRz2gZfYXR0cnPaDF9pbnB1\ndHNfZmxhdHIKAAAAcgoAAAD6a0M6L1VzZXJzL0FETUlOL0FwcERhdGEvTG9jYWwvUHJvZ3JhbXMv\nUHl0aG9uL1B5dGhvbjM4L2xpYi9zaXRlLXBhY2thZ2VzL3RlbnNvcmZsb3cvcHl0aG9uL29wcy9n\nZW5fbm5fb3BzLnB5ciQAAAC8EgAAc9IAAAAAIA4BBgEIAQIBBAEEAAQAAgACAAQBAgACAAIAAgAC\nAAIAAgECAAL9BAQGARIBHAEQAQYBAgECAQIAAgACAAIAAgECAAL+CAMQAQQBFAEEAQIAAgAIAQIA\nAgAC/wT/BAQOAQgBCAIKAQQBDAEKAQQBDAEKAQQBDAEKAQQBDAECAQQBAgACAAIAAgACAQIAAv4S\nAxQBBAECAAIACAECAAIAAv8E/wQEDgEIAQgBDAEKAQwBCAACAAgAAgEIAAIACP4EAwYBBAECAAIA\nAgAC/wQCBgE=\n", [5, 1, 1, 0.5, null], null], "function_type": "lambda", "module": "tensorflow.python.ops.gen_nn_ops", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["lambda_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wYAAAAAAAAAAAAAABAAAAAQAAAAQwAAAHNaAgAAdABqAHAMdACgAaEAfQZ8BmoCfQd8B2oDkAFy\nEHowdASgBXwGagZ8B2oHZAF8BXwHagh8AGQCfAFkA3wCZAR8A2QFfAShDn0IfAhXAFMABAB0CWoK\nawpyfAEAfQkBAHoQdAugDHwJfAWhAgEAVwA1AGQGfQl+CVgAWQBuFgQAdAlqDWsKcpABAAEAAQBZ\nAG4CWAB6GHQOfAB8AXwCfAN8BHwFfAZkB40HVwBTAAQAdAlqD2sKcsABAAEAAQBZAG5QBAB0EHQR\nZgJrCpABcg4BAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy\nCHwKBgBZAFMAggBZAG4CWAB8AWQGawiQAXIeZAp9AXQYoBl8AWQCoQJ9AXwCZAZrCJABcjhkC30C\ndBigGnwCZAOhAn0CfANkBmsIkAFyUmQLfQN0GKAafANkBKECfQN8BGQGawiQAXJsZAx9BHQYoBp8\nBGQFoQJ9BHokdBtqHGQBfAB8AXwCfAN8BHwFZAmNBy8EfQt9C30MfQ1XAG5QBAB0EHQRZgJrCpAB\ncuwBAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy5nwKBgBZ\nAFMAggBZAG4CWAB8DWQGZAaFAhkAfQh0GKAdoQCQAnJQZAJ8DKAeZAKhAWQDfAygH2QDoQFkBHwM\noB9kBKEBZAV8DKAfZAWhAWQNfAygIGQNoQFmCn0OfAxqIX0PdBigImQBfA98DnwIoQQBAHwILwF9\nCHwIUwApDuHxBAAATG9jYWwgUmVzcG9uc2UgTm9ybWFsaXphdGlvbi4KCiAgVGhlIDQtRCBgaW5w\ndXRgIHRlbnNvciBpcyB0cmVhdGVkIGFzIGEgMy1EIGFycmF5IG9mIDEtRCB2ZWN0b3JzIChhbG9u\nZyB0aGUgbGFzdAogIGRpbWVuc2lvbiksIGFuZCBlYWNoIHZlY3RvciBpcyBub3JtYWxpemVkIGlu\nZGVwZW5kZW50bHkuICBXaXRoaW4gYSBnaXZlbiB2ZWN0b3IsCiAgZWFjaCBjb21wb25lbnQgaXMg\nZGl2aWRlZCBieSB0aGUgd2VpZ2h0ZWQsIHNxdWFyZWQgc3VtIG9mIGlucHV0cyB3aXRoaW4KICBg\nZGVwdGhfcmFkaXVzYC4gIEluIGRldGFpbCwKCiAgICAgIHNxcl9zdW1bYSwgYiwgYywgZF0gPQog\nICAgICAgICAgc3VtKGlucHV0W2EsIGIsIGMsIGQgLSBkZXB0aF9yYWRpdXMgOiBkICsgZGVwdGhf\ncmFkaXVzICsgMV0gKiogMikKICAgICAgb3V0cHV0ID0gaW5wdXQgLyAoYmlhcyArIGFscGhhICog\nc3FyX3N1bSkgKiogYmV0YQoKICBGb3IgZGV0YWlscywgc2VlIFtLcml6aGV2c2t5IGV0IGFsLiwg\nSW1hZ2VOZXQgY2xhc3NpZmljYXRpb24gd2l0aCBkZWVwCiAgY29udm9sdXRpb25hbCBuZXVyYWwg\nbmV0d29ya3MgKE5JUFMgMjAxMildKGh0dHA6Ly9wYXBlcnMubmlwcy5jYy9wYXBlci80ODI0LWlt\nYWdlbmV0LWNsYXNzaWZpY2F0aW9uLXdpdGgtZGVlcC1jb252b2x1dGlvbmFsLW5ldXJhbC1uZXR3\nb3JrcykuCgogIEFyZ3M6CiAgICBpbnB1dDogQSBgVGVuc29yYC4gTXVzdCBiZSBvbmUgb2YgdGhl\nIGZvbGxvd2luZyB0eXBlczogYGhhbGZgLCBgYmZsb2F0MTZgLCBgZmxvYXQzMmAuCiAgICAgIDQt\nRC4KICAgIGRlcHRoX3JhZGl1czogQW4gb3B0aW9uYWwgYGludGAuIERlZmF1bHRzIHRvIGA1YC4K\nICAgICAgMC1ELiAgSGFsZi13aWR0aCBvZiB0aGUgMS1EIG5vcm1hbGl6YXRpb24gd2luZG93Lgog\nICAgYmlhczogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBbiBv\nZmZzZXQgKHVzdWFsbHkgcG9zaXRpdmUgdG8gYXZvaWQgZGl2aWRpbmcgYnkgMCkuCiAgICBhbHBo\nYTogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBIHNjYWxlIGZh\nY3RvciwgdXN1YWxseSBwb3NpdGl2ZS4KICAgIGJldGE6IEFuIG9wdGlvbmFsIGBmbG9hdGAuIERl\nZmF1bHRzIHRvIGAwLjVgLiBBbiBleHBvbmVudC4KICAgIG5hbWU6IEEgbmFtZSBmb3IgdGhlIG9w\nZXJhdGlvbiAob3B0aW9uYWwpLgoKICBSZXR1cm5zOgogICAgQSBgVGVuc29yYC4gSGFzIHRoZSBz\nYW1lIHR5cGUgYXMgYGlucHV0YC4KICDaA0xSTtoMZGVwdGhfcmFkaXVz2gRiaWFz2gVhbHBoYdoE\nYmV0YU6pBnIDAAAAcgQAAAByBQAAAHIGAAAA2gRuYW1l2gNjdHipACkG2gVpbnB1dHIDAAAAcgQA\nAAByBQAAAHIGAAAAcggAAADpBQAAAOkBAAAA5wAAAAAAAOA/2gFUKSPaCF9jb250ZXh02gdjb250\nZXh02hJfdGhyZWFkX2xvY2FsX2RhdGHaCGlzX2VhZ2Vy2gpweXdyYXBfdGZl2hZURkVfUHlfRmFz\ndFBhdGhFeGVjdXRl2g9fY29udGV4dF9oYW5kbGXaC2RldmljZV9uYW1l2gxvcF9jYWxsYmFja3Pa\nBV9jb3Jl2hVfTm90T2tTdGF0dXNFeGNlcHRpb27aBF9vcHPaGHJhaXNlX2Zyb21fbm90X29rX3N0\nYXR1c9oSX0ZhbGxiYWNrRXhjZXB0aW9u2hJscm5fZWFnZXJfZmFsbGJhY2vaEl9TeW1ib2xpY0V4\nY2VwdGlvbtoJVHlwZUVycm9y2gpWYWx1ZUVycm9y2glfZGlzcGF0Y2jaCGRpc3BhdGNo2gNscm7a\nBGRpY3TaDE9wRGlzcGF0Y2hlctoNTk9UX1NVUFBPUlRFRNoIX2V4ZWN1dGXaCG1ha2VfaW502gpt\nYWtlX2Zsb2F02g9fb3BfZGVmX2xpYnJhcnnaEF9hcHBseV9vcF9oZWxwZXLaFG11c3RfcmVjb3Jk\nX2dyYWRpZW502g1fZ2V0X2F0dHJfaW502ghnZXRfYXR0ctoOX2dldF9hdHRyX3R5cGXaBmlucHV0\nc9oPcmVjb3JkX2dyYWRpZW50KRByCwAAAHIDAAAAcgQAAAByBQAAAHIGAAAAcggAAADaBF9jdHja\nA3RsZNoHX3Jlc3VsdNoBZdoGcmVzdWx02gFf2gNfb3DaCF9vdXRwdXRz2gZfYXR0cnPaDF9pbnB1\ndHNfZmxhdHIKAAAAcgoAAAD6a0M6L1VzZXJzL0FETUlOL0FwcERhdGEvTG9jYWwvUHJvZ3JhbXMv\nUHl0aG9uL1B5dGhvbjM4L2xpYi9zaXRlLXBhY2thZ2VzL3RlbnNvcmZsb3cvcHl0aG9uL29wcy9n\nZW5fbm5fb3BzLnB5ciQAAAC8EgAAc9IAAAAAIA4BBgEIAQIBBAEEAAQAAgACAAQBAgACAAIAAgAC\nAAIAAgECAAL9BAQGARIBHAEQAQYBAgECAQIAAgACAAIAAgECAAL+CAMQAQQBFAEEAQIAAgAIAQIA\nAgAC/wT/BAQOAQgBCAIKAQQBDAEKAQQBDAEKAQQBDAEKAQQBDAECAQQBAgACAAIAAgACAQIAAv4S\nAxQBBAECAAIACAECAAIAAv8E/wQEDgEIAQgBDAEKAQwBCAACAAgAAgEIAAIACP4EAwYBBAECAAIA\nAgAC/wQCBgE=\n", [5, 1, 1, 0.5, null], null], "function_type": "lambda", "module": "tensorflow.python.ops.gen_nn_ops", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["lambda_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wYAAAAAAAAAAAAAABAAAAAQAAAAQwAAAHNaAgAAdABqAHAMdACgAaEAfQZ8BmoCfQd8B2oDkAFy\nEHowdASgBXwGagZ8B2oHZAF8BXwHagh8AGQCfAFkA3wCZAR8A2QFfAShDn0IfAhXAFMABAB0CWoK\nawpyfAEAfQkBAHoQdAugDHwJfAWhAgEAVwA1AGQGfQl+CVgAWQBuFgQAdAlqDWsKcpABAAEAAQBZ\nAG4CWAB6GHQOfAB8AXwCfAN8BHwFfAZkB40HVwBTAAQAdAlqD2sKcsABAAEAAQBZAG5QBAB0EHQR\nZgJrCpABcg4BAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy\nCHwKBgBZAFMAggBZAG4CWAB8AWQGawiQAXIeZAp9AXQYoBl8AWQCoQJ9AXwCZAZrCJABcjhkC30C\ndBigGnwCZAOhAn0CfANkBmsIkAFyUmQLfQN0GKAafANkBKECfQN8BGQGawiQAXJsZAx9BHQYoBp8\nBGQFoQJ9BHokdBtqHGQBfAB8AXwCfAN8BHwFZAmNBy8EfQt9C30MfQ1XAG5QBAB0EHQRZgJrCpAB\ncuwBAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy5nwKBgBZ\nAFMAggBZAG4CWAB8DWQGZAaFAhkAfQh0GKAdoQCQAnJQZAJ8DKAeZAKhAWQDfAygH2QDoQFkBHwM\noB9kBKEBZAV8DKAfZAWhAWQNfAygIGQNoQFmCn0OfAxqIX0PdBigImQBfA98DnwIoQQBAHwILwF9\nCHwIUwApDuHxBAAATG9jYWwgUmVzcG9uc2UgTm9ybWFsaXphdGlvbi4KCiAgVGhlIDQtRCBgaW5w\ndXRgIHRlbnNvciBpcyB0cmVhdGVkIGFzIGEgMy1EIGFycmF5IG9mIDEtRCB2ZWN0b3JzIChhbG9u\nZyB0aGUgbGFzdAogIGRpbWVuc2lvbiksIGFuZCBlYWNoIHZlY3RvciBpcyBub3JtYWxpemVkIGlu\nZGVwZW5kZW50bHkuICBXaXRoaW4gYSBnaXZlbiB2ZWN0b3IsCiAgZWFjaCBjb21wb25lbnQgaXMg\nZGl2aWRlZCBieSB0aGUgd2VpZ2h0ZWQsIHNxdWFyZWQgc3VtIG9mIGlucHV0cyB3aXRoaW4KICBg\nZGVwdGhfcmFkaXVzYC4gIEluIGRldGFpbCwKCiAgICAgIHNxcl9zdW1bYSwgYiwgYywgZF0gPQog\nICAgICAgICAgc3VtKGlucHV0W2EsIGIsIGMsIGQgLSBkZXB0aF9yYWRpdXMgOiBkICsgZGVwdGhf\ncmFkaXVzICsgMV0gKiogMikKICAgICAgb3V0cHV0ID0gaW5wdXQgLyAoYmlhcyArIGFscGhhICog\nc3FyX3N1bSkgKiogYmV0YQoKICBGb3IgZGV0YWlscywgc2VlIFtLcml6aGV2c2t5IGV0IGFsLiwg\nSW1hZ2VOZXQgY2xhc3NpZmljYXRpb24gd2l0aCBkZWVwCiAgY29udm9sdXRpb25hbCBuZXVyYWwg\nbmV0d29ya3MgKE5JUFMgMjAxMildKGh0dHA6Ly9wYXBlcnMubmlwcy5jYy9wYXBlci80ODI0LWlt\nYWdlbmV0LWNsYXNzaWZpY2F0aW9uLXdpdGgtZGVlcC1jb252b2x1dGlvbmFsLW5ldXJhbC1uZXR3\nb3JrcykuCgogIEFyZ3M6CiAgICBpbnB1dDogQSBgVGVuc29yYC4gTXVzdCBiZSBvbmUgb2YgdGhl\nIGZvbGxvd2luZyB0eXBlczogYGhhbGZgLCBgYmZsb2F0MTZgLCBgZmxvYXQzMmAuCiAgICAgIDQt\nRC4KICAgIGRlcHRoX3JhZGl1czogQW4gb3B0aW9uYWwgYGludGAuIERlZmF1bHRzIHRvIGA1YC4K\nICAgICAgMC1ELiAgSGFsZi13aWR0aCBvZiB0aGUgMS1EIG5vcm1hbGl6YXRpb24gd2luZG93Lgog\nICAgYmlhczogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBbiBv\nZmZzZXQgKHVzdWFsbHkgcG9zaXRpdmUgdG8gYXZvaWQgZGl2aWRpbmcgYnkgMCkuCiAgICBhbHBo\nYTogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBIHNjYWxlIGZh\nY3RvciwgdXN1YWxseSBwb3NpdGl2ZS4KICAgIGJldGE6IEFuIG9wdGlvbmFsIGBmbG9hdGAuIERl\nZmF1bHRzIHRvIGAwLjVgLiBBbiBleHBvbmVudC4KICAgIG5hbWU6IEEgbmFtZSBmb3IgdGhlIG9w\nZXJhdGlvbiAob3B0aW9uYWwpLgoKICBSZXR1cm5zOgogICAgQSBgVGVuc29yYC4gSGFzIHRoZSBz\nYW1lIHR5cGUgYXMgYGlucHV0YC4KICDaA0xSTtoMZGVwdGhfcmFkaXVz2gRiaWFz2gVhbHBoYdoE\nYmV0YU6pBnIDAAAAcgQAAAByBQAAAHIGAAAA2gRuYW1l2gNjdHipACkG2gVpbnB1dHIDAAAAcgQA\nAAByBQAAAHIGAAAAcggAAADpBQAAAOkBAAAA5wAAAAAAAOA/2gFUKSPaCF9jb250ZXh02gdjb250\nZXh02hJfdGhyZWFkX2xvY2FsX2RhdGHaCGlzX2VhZ2Vy2gpweXdyYXBfdGZl2hZURkVfUHlfRmFz\ndFBhdGhFeGVjdXRl2g9fY29udGV4dF9oYW5kbGXaC2RldmljZV9uYW1l2gxvcF9jYWxsYmFja3Pa\nBV9jb3Jl2hVfTm90T2tTdGF0dXNFeGNlcHRpb27aBF9vcHPaGHJhaXNlX2Zyb21fbm90X29rX3N0\nYXR1c9oSX0ZhbGxiYWNrRXhjZXB0aW9u2hJscm5fZWFnZXJfZmFsbGJhY2vaEl9TeW1ib2xpY0V4\nY2VwdGlvbtoJVHlwZUVycm9y2gpWYWx1ZUVycm9y2glfZGlzcGF0Y2jaCGRpc3BhdGNo2gNscm7a\nBGRpY3TaDE9wRGlzcGF0Y2hlctoNTk9UX1NVUFBPUlRFRNoIX2V4ZWN1dGXaCG1ha2VfaW502gpt\nYWtlX2Zsb2F02g9fb3BfZGVmX2xpYnJhcnnaEF9hcHBseV9vcF9oZWxwZXLaFG11c3RfcmVjb3Jk\nX2dyYWRpZW502g1fZ2V0X2F0dHJfaW502ghnZXRfYXR0ctoOX2dldF9hdHRyX3R5cGXaBmlucHV0\nc9oPcmVjb3JkX2dyYWRpZW50KRByCwAAAHIDAAAAcgQAAAByBQAAAHIGAAAAcggAAADaBF9jdHja\nA3RsZNoHX3Jlc3VsdNoBZdoGcmVzdWx02gFf2gNfb3DaCF9vdXRwdXRz2gZfYXR0cnPaDF9pbnB1\ndHNfZmxhdHIKAAAAcgoAAAD6a0M6L1VzZXJzL0FETUlOL0FwcERhdGEvTG9jYWwvUHJvZ3JhbXMv\nUHl0aG9uL1B5dGhvbjM4L2xpYi9zaXRlLXBhY2thZ2VzL3RlbnNvcmZsb3cvcHl0aG9uL29wcy9n\nZW5fbm5fb3BzLnB5ciQAAAC8EgAAc9IAAAAAIA4BBgEIAQIBBAEEAAQAAgACAAQBAgACAAIAAgAC\nAAIAAgECAAL9BAQGARIBHAEQAQYBAgECAQIAAgACAAIAAgECAAL+CAMQAQQBFAEEAQIAAgAIAQIA\nAgAC/wT/BAQOAQgBCAIKAQQBDAEKAQQBDAEKAQQBDAEKAQQBDAECAQQBAgACAAIAAgACAQIAAv4S\nAxQBBAECAAIACAECAAIAAv8E/wQEDgEIAQgBDAEKAQwBCAACAAgAAgEIAAIACP4EAwYBBAECAAIA\nAgAC/wQCBgE=\n", [5, 1, 1, 0.5, null], null], "function_type": "lambda", "module": "tensorflow.python.ops.gen_nn_ops", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["lambda_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wYAAAAAAAAAAAAAABAAAAAQAAAAQwAAAHNaAgAAdABqAHAMdACgAaEAfQZ8BmoCfQd8B2oDkAFy\nEHowdASgBXwGagZ8B2oHZAF8BXwHagh8AGQCfAFkA3wCZAR8A2QFfAShDn0IfAhXAFMABAB0CWoK\nawpyfAEAfQkBAHoQdAugDHwJfAWhAgEAVwA1AGQGfQl+CVgAWQBuFgQAdAlqDWsKcpABAAEAAQBZ\nAG4CWAB6GHQOfAB8AXwCfAN8BHwFfAZkB40HVwBTAAQAdAlqD2sKcsABAAEAAQBZAG5QBAB0EHQR\nZgJrCpABcg4BAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy\nCHwKBgBZAFMAggBZAG4CWAB8AWQGawiQAXIeZAp9AXQYoBl8AWQCoQJ9AXwCZAZrCJABcjhkC30C\ndBigGnwCZAOhAn0CfANkBmsIkAFyUmQLfQN0GKAafANkBKECfQN8BGQGawiQAXJsZAx9BHQYoBp8\nBGQFoQJ9BHokdBtqHGQBfAB8AXwCfAN8BHwFZAmNBy8EfQt9C30MfQ1XAG5QBAB0EHQRZgJrCpAB\ncuwBAAEAAQB0EqATdBRkCHQVfAB8AXwCfAN8BHwFZAmNBqEDfQp8CnQSahZqF2sJkAFy5nwKBgBZ\nAFMAggBZAG4CWAB8DWQGZAaFAhkAfQh0GKAdoQCQAnJQZAJ8DKAeZAKhAWQDfAygH2QDoQFkBHwM\noB9kBKEBZAV8DKAfZAWhAWQNfAygIGQNoQFmCn0OfAxqIX0PdBigImQBfA98DnwIoQQBAHwILwF9\nCHwIUwApDuHxBAAATG9jYWwgUmVzcG9uc2UgTm9ybWFsaXphdGlvbi4KCiAgVGhlIDQtRCBgaW5w\ndXRgIHRlbnNvciBpcyB0cmVhdGVkIGFzIGEgMy1EIGFycmF5IG9mIDEtRCB2ZWN0b3JzIChhbG9u\nZyB0aGUgbGFzdAogIGRpbWVuc2lvbiksIGFuZCBlYWNoIHZlY3RvciBpcyBub3JtYWxpemVkIGlu\nZGVwZW5kZW50bHkuICBXaXRoaW4gYSBnaXZlbiB2ZWN0b3IsCiAgZWFjaCBjb21wb25lbnQgaXMg\nZGl2aWRlZCBieSB0aGUgd2VpZ2h0ZWQsIHNxdWFyZWQgc3VtIG9mIGlucHV0cyB3aXRoaW4KICBg\nZGVwdGhfcmFkaXVzYC4gIEluIGRldGFpbCwKCiAgICAgIHNxcl9zdW1bYSwgYiwgYywgZF0gPQog\nICAgICAgICAgc3VtKGlucHV0W2EsIGIsIGMsIGQgLSBkZXB0aF9yYWRpdXMgOiBkICsgZGVwdGhf\ncmFkaXVzICsgMV0gKiogMikKICAgICAgb3V0cHV0ID0gaW5wdXQgLyAoYmlhcyArIGFscGhhICog\nc3FyX3N1bSkgKiogYmV0YQoKICBGb3IgZGV0YWlscywgc2VlIFtLcml6aGV2c2t5IGV0IGFsLiwg\nSW1hZ2VOZXQgY2xhc3NpZmljYXRpb24gd2l0aCBkZWVwCiAgY29udm9sdXRpb25hbCBuZXVyYWwg\nbmV0d29ya3MgKE5JUFMgMjAxMildKGh0dHA6Ly9wYXBlcnMubmlwcy5jYy9wYXBlci80ODI0LWlt\nYWdlbmV0LWNsYXNzaWZpY2F0aW9uLXdpdGgtZGVlcC1jb252b2x1dGlvbmFsLW5ldXJhbC1uZXR3\nb3JrcykuCgogIEFyZ3M6CiAgICBpbnB1dDogQSBgVGVuc29yYC4gTXVzdCBiZSBvbmUgb2YgdGhl\nIGZvbGxvd2luZyB0eXBlczogYGhhbGZgLCBgYmZsb2F0MTZgLCBgZmxvYXQzMmAuCiAgICAgIDQt\nRC4KICAgIGRlcHRoX3JhZGl1czogQW4gb3B0aW9uYWwgYGludGAuIERlZmF1bHRzIHRvIGA1YC4K\nICAgICAgMC1ELiAgSGFsZi13aWR0aCBvZiB0aGUgMS1EIG5vcm1hbGl6YXRpb24gd2luZG93Lgog\nICAgYmlhczogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBbiBv\nZmZzZXQgKHVzdWFsbHkgcG9zaXRpdmUgdG8gYXZvaWQgZGl2aWRpbmcgYnkgMCkuCiAgICBhbHBo\nYTogQW4gb3B0aW9uYWwgYGZsb2F0YC4gRGVmYXVsdHMgdG8gYDFgLgogICAgICBBIHNjYWxlIGZh\nY3RvciwgdXN1YWxseSBwb3NpdGl2ZS4KICAgIGJldGE6IEFuIG9wdGlvbmFsIGBmbG9hdGAuIERl\nZmF1bHRzIHRvIGAwLjVgLiBBbiBleHBvbmVudC4KICAgIG5hbWU6IEEgbmFtZSBmb3IgdGhlIG9w\nZXJhdGlvbiAob3B0aW9uYWwpLgoKICBSZXR1cm5zOgogICAgQSBgVGVuc29yYC4gSGFzIHRoZSBz\nYW1lIHR5cGUgYXMgYGlucHV0YC4KICDaA0xSTtoMZGVwdGhfcmFkaXVz2gRiaWFz2gVhbHBoYdoE\nYmV0YU6pBnIDAAAAcgQAAAByBQAAAHIGAAAA2gRuYW1l2gNjdHipACkG2gVpbnB1dHIDAAAAcgQA\nAAByBQAAAHIGAAAAcggAAADpBQAAAOkBAAAA5wAAAAAAAOA/2gFUKSPaCF9jb250ZXh02gdjb250\nZXh02hJfdGhyZWFkX2xvY2FsX2RhdGHaCGlzX2VhZ2Vy2gpweXdyYXBfdGZl2hZURkVfUHlfRmFz\ndFBhdGhFeGVjdXRl2g9fY29udGV4dF9oYW5kbGXaC2RldmljZV9uYW1l2gxvcF9jYWxsYmFja3Pa\nBV9jb3Jl2hVfTm90T2tTdGF0dXNFeGNlcHRpb27aBF9vcHPaGHJhaXNlX2Zyb21fbm90X29rX3N0\nYXR1c9oSX0ZhbGxiYWNrRXhjZXB0aW9u2hJscm5fZWFnZXJfZmFsbGJhY2vaEl9TeW1ib2xpY0V4\nY2VwdGlvbtoJVHlwZUVycm9y2gpWYWx1ZUVycm9y2glfZGlzcGF0Y2jaCGRpc3BhdGNo2gNscm7a\nBGRpY3TaDE9wRGlzcGF0Y2hlctoNTk9UX1NVUFBPUlRFRNoIX2V4ZWN1dGXaCG1ha2VfaW502gpt\nYWtlX2Zsb2F02g9fb3BfZGVmX2xpYnJhcnnaEF9hcHBseV9vcF9oZWxwZXLaFG11c3RfcmVjb3Jk\nX2dyYWRpZW502g1fZ2V0X2F0dHJfaW502ghnZXRfYXR0ctoOX2dldF9hdHRyX3R5cGXaBmlucHV0\nc9oPcmVjb3JkX2dyYWRpZW50KRByCwAAAHIDAAAAcgQAAAByBQAAAHIGAAAAcggAAADaBF9jdHja\nA3RsZNoHX3Jlc3VsdNoBZdoGcmVzdWx02gFf2gNfb3DaCF9vdXRwdXRz2gZfYXR0cnPaDF9pbnB1\ndHNfZmxhdHIKAAAAcgoAAAD6a0M6L1VzZXJzL0FETUlOL0FwcERhdGEvTG9jYWwvUHJvZ3JhbXMv\nUHl0aG9uL1B5dGhvbjM4L2xpYi9zaXRlLXBhY2thZ2VzL3RlbnNvcmZsb3cvcHl0aG9uL29wcy9n\nZW5fbm5fb3BzLnB5ciQAAAC8EgAAc9IAAAAAIA4BBgEIAQIBBAEEAAQAAgACAAQBAgACAAIAAgAC\nAAIAAgECAAL9BAQGARIBHAEQAQYBAgECAQIAAgACAAIAAgECAAL+CAMQAQQBFAEEAQIAAgAIAQIA\nAgAC/wT/BAQOAQgBCAIKAQQBDAEKAQQBDAEKAQQBDAEKAQQBDAECAQQBAgACAAIAAgACAQIAAv4S\nAxQBBAECAAIACAECAAIAAv8E/wQEDgEIAQgBDAEKAQwBCAACAAgAAgEIAAIACP4EAwYBBAECAAIA\nAgAC/wQCBgE=\n", [5, 1, 1, 0.5, null], null], "function_type": "lambda", "module": "tensorflow.python.ops.gen_nn_ops", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["lambda_4", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 2048, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 13, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}